DataProcessors/упРМАдминистратораГеоданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМАдминистратораГеоданных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/упГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГеографическиеЗоны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Nominatim_place_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>osm_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляУчетаМестоположений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроходитЧерез180Меридиан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиПолигонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полигон</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолигонПростой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/упРМАдминистратораГеоданных/Forms/ФормаСпискаСправочникаупГеозоныУдаленные/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Подтвержден") Тогда
		ЭтаФорма.Заголовок = "Подтвержденные географические зоны";
		СписокГеозон.ТекстЗапроса = ПолучитьТекстДляПодтвержденных();
	ИначеЕсли Параметры.Свойство("ПометкаУдаления") Тогда
		Если Параметры.ПометкаУдаления Тогда
			ЭтаФорма.Заголовок = "Недействующие географические зоны";
		Иначе
			ЭтаФорма.Заголовок = "Действующие географические зоны";
		КонецЕсли;	
		СписокГеозон.ТекстЗапроса = ПолучитьТекстДляПометкиУдаления(Параметры.ПометкаУдаления);
	ИначеЕсли Параметры.Свойство("СписокНегеокодированных") Тогда
		ЭтаФорма.Заголовок = "Негеокодированные географические зоны";
		СписокГеозон.ТекстЗапроса = ПолучитьТекстДляНегеокодированных();
	ИначеЕсли Параметры.Свойство("СПобочнымиКоэффициентами") Тогда
		ЭтаФорма.Заголовок = "Географические зоны с побочными коэффициентами";
		СписокГеозон.ТекстЗапроса = ПолучитьТекстДляЗонСПобочнымиКоэффициентами();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстДляПодтвержденных()
	
	Текст = "ВЫБРАТЬ
	        |	упГеографическиеЗоны.Ссылка,
	        |	упГеографическиеЗоны.Наименование,
	        |	упГеографическиеЗоны.Подтверждена
	        |ИЗ
	        |	Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
	        |ГДЕ
	        |	упГеографическиеЗоны.Подтверждена = ИСТИНА"	 ;
	
	Возврат Текст;
	
КонецФункции	

&НаСервере
Функция ПолучитьТекстДляНегеокодированных()
	
	Текст = "ВЫБРАТЬ
	        |	упГеографическиеЗоны.Наименование,
	        |	упГеографическиеЗоны.Подтверждена,
	        |	упГеографическиеЗоны.Ссылка
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		упГеографическиеЗоны.Ссылка КАК Ссылка,
	        |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(упГеографическиеЗоныПолигон.НомерСтроки, 0)) КАК КоличествоСтрок
	        |	ИЗ
	        |		Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упГеографическиеЗоны.Полигон КАК упГеографическиеЗоныПолигон
	        |			ПО (упГеографическиеЗоныПолигон.Ссылка = упГеографическиеЗоны.Ссылка)
	        |	ГДЕ
	        |		упГеографическиеЗоны.ПометкаУдаления = ЛОЖЬ
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		упГеографическиеЗоны.Ссылка) КАК ВложенныйЗапрос
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
	        |		ПО ВложенныйЗапрос.Ссылка = упГеографическиеЗоны.Ссылка
	        |ГДЕ
	        |	ВложенныйЗапрос.КоличествоСтрок < 3"	 ;
	
	Возврат Текст;
	
КонецФункции	

&НаСервере
Функция ПолучитьТекстДляЗонСПобочнымиКоэффициентами()
	
	Текст = "ВЫБРАТЬ
	        |	упГеографическиеЗоны.Наименование,
	        |	упГеографическиеЗоны.Подтверждена,
	        |	упГеографическиеЗоны.Ссылка
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		упГеографическиеЗоны.Ссылка КАК Ссылка,
	        |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упГеографическиеЗоныКоэффициентыВремени.НомерСтроки) КАК КоличествоСтрок
	        |	ИЗ
	        |		Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упГеографическиеЗоны.КоэффициентыВремени КАК упГеографическиеЗоныКоэффициентыВремени
	        |			ПО (упГеографическиеЗоныКоэффициентыВремени.Ссылка = упГеографическиеЗоны.Ссылка)
	        |	ГДЕ
	        |		упГеографическиеЗоны.ПометкаУдаления = ЛОЖЬ
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		упГеографическиеЗоны.Ссылка) КАК ВложенныйЗапрос
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
	        |		ПО ВложенныйЗапрос.Ссылка = упГеографическиеЗоны.Ссылка
	        |ГДЕ
	        |	ВложенныйЗапрос.КоличествоСтрок > 0"	 ;
	
	Возврат Текст;
	
КонецФункции	

&НаСервере
Функция ПолучитьТекстДляПометкиУдаления(ПометкаУдаления)
	
	Текст = "ВЫБРАТЬ
	        |	упГеографическиеЗоны.Ссылка,
	        |	упГеографическиеЗоны.Наименование,
	        |	упГеографическиеЗоны.Подтверждена
	        |ИЗ
	        |	Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
	        |ГДЕ
	        |	упГеографическиеЗоны.ПометкаУдаления = ИСТИНА"	 ;
			
			Если Не ПометкаУдаления Тогда
				Текст = СтрЗаменить(Текст, "ИСТИНА", "ЛОЖЬ");
			КонецЕсли;	
	
	Возврат Текст;
КонецФункции	

&НаКлиенте
Процедура ОбъектВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СсылкаНаЭлемент = Элементы.СписокГеозон.ТекущиеДанные.Ссылка;
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлемент);
	ОткрытьФорму("Справочник.упГеографическиеЗоны.Форма.ФормаЭлемента", ПараметрыФормы); 

КонецПроцедуры
